InformationRegisters/СвязанныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеРаботы</Name>
			<Comment>Связанные работы и детали для авторабот</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяРабота</Name>
					<Comment>Связанная авторабота или номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/WA_Подписки/Ext/Module.bsl
Процедура WA_ЗаписьЗаказНарядаПриЗаписи(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
	ОтправитьЗапросВWA(Строка(Источник.Ссылка.УникальныйИдентификатор()),"5","U");

КонецПроцедуры

Процедура WA_ЗаписьЗаявкиНаРемонтПриЗаписи(Источник, Отказ) Экспорт
	
	// Передача данных в WA
	ОтправитьЗапросВWA(Строка(Источник.Ссылка.УникальныйИдентификатор()),"1","U");
	
КонецПроцедуры

Процедура WA_ЗаписьСпециальногоПредложения(Источник, Отказ) Экспорт
	Если Источник.Ссылка.ЭтоГруппа = Ложь Тогда
	Если Источник.Ссылка.ЭтоДополнительноеПредложение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СвязанныеРаботы.Авторабота,
			|	СвязанныеРаботы.СвязаннаяРабота
			|ИЗ
			|	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
			|ГДЕ
			|	СвязанныеРаботы.Авторабота = &Работа";
			
		Запрос.УстановитьПараметр("Работа", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
		// Передача данных в WA
		ОтправитьЗапросВWA(Строка(Источник.Ссылка.Код),"4","C");
		КонецЕсли;
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры
